{"model_name": "musicnetgen", "layers_config": {"config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20]}}, {"class_name": "Embedding", "config": {"input_dim": 30, "output_dim": 128}}, {"class_name": "LSTM", "config": {"units": 128, "activation": "tanh", "recurrent_activation": "sigmoid"}}, {"class_name": "Dense", "config": {"units": 30, "activation": "linear"}}]}}, "weight_b64": 